Repository: LilyAshford/smartprice
Catalog: app/locales/*/LC_MESSAGES/messages.po
Languages: es, ru

source: SmartPrice saved me $50 on a new laptop! I set my target price and got an email as soon as it dropped. So easy!
es: ¡SmartPrice me ahorró $50 en una nueva laptop! Establecí mi precio objetivo y recibí un correo electrónico tan pronto como bajó. ¡Muy fácil!
ru: SmartPrice сэкономил мне $50 на новом ноутбуке! Я установил целевую цену и получил письмо, как только она снизилась. Так просто!

source: Alex P., Tech Enthusiast
es: Alex P., Entusiasta de la tecnología
ru: Алекс П., Техноэнтузиаст

source: I love that I can track items from multiple stores all in one place. The Telegram notifications are super convenient too!
es: ¡Me encanta que pueda rastrear artículos de varias tiendas en un solo lugar! Las notificaciones de Telegram también son súper convenientes.
ru: Мне нравится, что я могу отслеживать товары из разных магазинов в одном месте. Уведомления в Telegram тоже очень удобны!

source: Maria G., Savvy Shopper
es: Maria G., Compradora inteligente
ru: Мария Г., Умный покупатель

source: Finally, a price tracker that just works. Simple interface, reliable notifications. Highly recommend SmartPrice!
es: ¡Por fin, un rastreador de precios que simplemente funciona! Interfaz sencilla, notificaciones confiables. ¡Recomiendo encarecidamente SmartPrice!
ru: Наконец-то трекер цен, который просто работает. Простой интерфейс, надежные уведомления. Настоятельно рекомендую SmartPrice!

source: David K., Online Bargain Hunter
es: David K., Cazador de gangas en línea
ru: Давид К., Охотник за онлайн-выгодой

source: Ready to Start Saving?
es: ¿Listo para empezar a ahorrar?
ru: Готовы начать экономить?

source: Join thousands of smart shoppers who use SmartPrice to get the best deals. It's free to get started!
es: ¡Únete a miles de compradores inteligentes que usan SmartPrice para obtener las mejores ofertas! ¡Es gratis para empezar!
ru: Присоединяйтесь к тысячам умных покупателей, которые используют SmartPrice, чтобы получать лучшие предложения. Начать бесплатно!

source: Sign Up Now - It's Free!
es: ¡Regístrate ahora, es gratis!
ru: Зарегистрируйтесь сейчас — это бесплатно!

source: Difference
es: Diferencia
ru: Разница

source: Interval:
es: Intervalo:
ru: Интервал:

source: Last Check:
es: Última verificación:
ru: Последняя проверка:

source: Next Check:
es: Próxima verificación:
ru: Следующая проверка:

source: Date
es: Fecha
ru: Дата

source: Update the details for "%(name)s"
es: Actualizar los detalles para "%(name)s"
ru: Обновите данные для "%(name)s"

source: e.g., My Awesome Gadget
es: Por ejemplo, Mi Gadget Increíble
ru: например, Мой потрясающий гаджет

source: Original URL (not editable):
es: URL original (no editable):
ru: Исходный URL (нельзя редактировать):

source: Welcome back, {}!
es: ¡Bienvenido de nuevo, {}!
ru: С возвращением, {}!

source: Language:
es: Idioma:
ru: Язык:

source: Total Tracked Products:
es: Total de productos rastreados:
ru: Всего отслеживаемых товаров:

source: Products with Price Drops:
es: Productos con bajadas de precio:
ru: Товары со снижением цены:

source: No price drops currently detected.
es: No se han detectado bajadas de precio actualmente.
ru: На данный момент снижение цен не обнаружено.

source: Member since:
es: Miembro desde:
ru: Участник с:

source: Quick Actions
es: Acciones rápidas
ru: Быстрые действия

source: Current:
es: Actual:
ru: Текущая:

source: View All Products
es: Ver todos los productos
ru: Посмотреть все товары

source: You are not tracking any products yet.
es: Aún no estás rastreando ningún producto.
ru: Вы пока не отслеживаете ни одного товара.

source: Share Your Feedback
es: Comparte tus comentarios
ru: Поделитесь своим отзывом

source: Help us make SmartPrice better! Your thoughts and suggestions are valuable to us.
es: ¡Ayúdanos a mejorar SmartPrice! Tus opiniones y sugerencias son valiosas para nosotros.
ru: Помогите нам улучшить SmartPrice! Ваши мысли и предложения очень ценны для нас.

source: Back
es: Volver
ru: Назад

source: Manage your personal and notification settings.
es: Administra tus configuraciones personales y de notificaciones.
ru: Управляйте вашими личными настройками и уведомлениями.

source: Security
es: Seguridad
ru: Безопасность

source: Interface Language
es: Idioma de la interfaz
ru: Язык интерфейса

source: This setting changes the language of the website interface.
es: Esta configuración cambia el idioma de la interfaz del sitio web.
ru: Эта настройка изменяет язык интерфейса сайта.

source: To connect your Telegram account, simply click the button below and press "Start" in the Telegram app.
es: Para conectar tu cuenta de Telegram, simplemente haz clic en el botón de abajo y presiona "Iniciar" en la aplicación de Telegram.
ru: Чтобы подключить ваш аккаунт Telegram, просто нажмите кнопку ниже и выберите "Start" в приложении Telegram.

source: Your Telegram account is already connected!
es: ¡Tu cuenta de Telegram ya está conectada!
ru: Ваш аккаунт Telegram уже подключен!

source: Connect with Telegram
es: Conectar con Telegram
ru: Подключиться через Telegram

source: Back to Settings
es: Volver a Configuraciones
ru: Вернуться к настройкам

source: Here are all the products you are currently tracking.
es: Aquí están todos los productos que estás rastreando actualmente.
ru: Здесь представлены все товары, которые вы сейчас отслеживаете.

source: Note: Price may differ by 5-7%% due to payment method discounts.
es: Nota: El precio puede diferir en un 5-7%% debido a descuentos por métodos de pago.
ru: Примечание: Цена может отличаться на 5-7%% из-за скидок на способы оплаты.

source: Last Checked:
es: Última verificación:
ru: Последняя проверка:

source: Never
es: Nunca
ru: Никогда

source: hours
es: horas
ru: часов

source: Are you sure you want to delete this product tracking?
es: ¿Estás seguro de que quieres eliminar el seguimiento de este producto?
ru: Вы уверены, что хотите удалить отслеживание этого товара?

source: You are not tracking any products yet
es: Aún no estás rastreando ningún producto
ru: Вы пока не отслеживаете ни одного товара

source: Add First Product
es: Añadir primer producto
ru: Добавить первый товар

source: Unread:
es: No leídos:
ru: Непрочитанные:

source: Mark All as Read
es: Marcar todos como leídos
ru: Отметить все как прочитанные

source: Clear All
es: Borrar todo
ru: Очистить все

source: Read
es: Leído
ru: Прочитано

source: View
es: Ver
ru: Просмотреть

source: All Quiet Here
es: Todo tranquilo aquí
ru: Здесь все тихо

source: You have no unread notifications. We will let you know when there is news about your products!
es: No tienes notificaciones no leídas. ¡Te avisaremos cuando haya noticias sobre tus productos!
ru: У вас нет непрочитанных уведомлений. Мы сообщим вам, когда появятся новости о ваших товарах!

source: View My Tracked Products
es: Ver mis productos rastreados
ru: Просмотреть мои отслеживаемые товары

source: Telegram token is required
es: Se requiere token de Telegram
ru: Требуется токен Telegram

source: Invalid Telegram bot token format
es: Formato de token de bot de Telegram inválido
ru: Неверный формат токена Telegram бота

source: Invalid URL: missing scheme (e.g., https://) or domain
es: URL inválido: falta el esquema (por ejemplo, https://) o el dominio
ru: Неверный URL: отсутствует схема (например, https://) или домен

source: Only http:// and https:// URLs are supported
es: Solo se admiten URLs con http:// y https://
ru: Поддерживаются только URL с http:// и https://

source: Invalid URL format: %(error)s
es: Formato de URL inválido: %(error)s
ru: Неверный формат URL: %(error)s

source: Please use a different email address.
es: Por favor, usa una dirección de correo electrónico diferente.
ru: Пожалуйста, используйте другой адрес электронной почты.

source: Password must contain at least one uppercase letter.
es: La contraseña debe contener al menos una letra mayúscula.
ru: Пароль должен содержать хотя бы одну заглавную букву.

source: Password must contain at least one lowercase letter.
es: La contraseña debe contener al menos una letra minúscula.
ru: Пароль должен содержать хотя бы одну строчную букву.

source: Password must contain at least one digit.
es: La contraseña debe contener al menos un dígito.
ru: Пароль должен содержать хотя бы одну цифру.

source: Password must contain at least one special character (@$!%*?&#).
es: La contraseña debe contener al menos un carácter especial (@$!%*?&#).
ru: Пароль должен содержать хотя бы один специальный символ (@$!%*?&#).

source: Heads up! Note on Wildberries prices: The price in our app may differ slightly (5-7%) from Wildberries' website. This happens because Wildberries shows discounted prices (e.g., for WB Wallet or SBP payments), while we display the actual price from their system — what you’d pay without extra discounts.
ru: Внимание! Примечание о ценах на Wildberries: цена в нашем приложении может немного отличаться (на 5-7%) от цены на сайте Wildberries. Это происходит потому, что Wildberries показывает цены со скидками (например, для WB Wallet или оплаты через СБП), а мы отображаем фактическую цену из их системы — ту, которую вы заплатите без дополнительных скидок.

source: Error!
ru: Ошибка!

source: No
ru: Нет

source: Total:
ru: Всего:
