Repository: LilyAshford/smartprice
Catalog: app/locales/*/LC_MESSAGES/messages.po
Languages: es, ru

source: Editing User:
es: Editando Usuario:
ru: Редактирование пользователя:

source: Cancel
es: Cancelar
ru: Отмена

source: Admin Dashboard
es: Panel de Administración
ru: Панель администратора

source: SmartPrice Admin Dashboard
es: Panel de Administración de SmartPrice
ru: Панель администратора SmartPrice

source: Go to Profile
es: Ir al Perfil
ru: Перейти в профиль

source: Users
es: Usuarios
ru: Пользователи

source: users registered
es: usuarios registrados
ru: зарегистрированных пользователей

source: sent in last 24 hours
es: enviadas en las últimas 24 horas
ru: отправлено за последние 24 часа

source: Platform Statistics
es: Estadísticas de la Plataforma
ru: Статистика платформы

source: Domain
es: Dominio
ru: Домен

source: Refresh Statistics
es: Actualizar Estadísticas
ru: Обновить статистику

source: Testing Tools
es: Herramientas de Prueba
ru: Инструменты тестирования

source: Real Price Check
es: Verificación de Precio Real
ru: Проверка реальной цены

source: Queue a task to fetch the current price for a product from the live website.
es: Encola una tarea para obtener el precio actual de un producto desde el sitio web en vivo.
ru: Поставить задачу на получение текущей цены товара с сайта в реальном времени.

source: Enter product ID for all price checks
es: Ingresa el ID del producto para todas las verificaciones de precio
ru: Введите ID товара для всех проверок цен

source: Mock Price Check
es: Verificación de Precio Simulado
ru: Тестовая проверка цены

source: Simulate different pricing scenarios to test notification logic without making real requests.
es: Simula diferentes escenarios de precios para probar la lógica de notificación sin hacer solicitudes reales.
ru: Имитируйте различные ценовые сценарии для тестирования логики уведомлений без реальных запросов.

source: Send a pre-formatted test notification to a user to verify delivery channels.
es: Envía una notificación de prueba preformateada a un usuario para verificar los canales de entrega.
ru: Отправить предварительно отформатированное тестовое уведомление пользователю для проверки каналов доставки.

source: User Details: %(username)s
es: Detalles del Usuario: %(username)s
ru: Данные пользователя: %(username)s

source: Telegram Chat ID
es: ID del Chat de Telegram
ru: ID чата Telegram

source: Confirmed
es: Confirmado
ru: Подтвержден

source: Active
es: Activo
ru: Активен

source: Administrator
es: Administrador
ru: Администратор

source: Last Seen
es: Visto por última vez
ru: Последний вход

source: Tracked Products
es: Productos Rastreados
ru: Отслеживаемые товары

source: No products tracked by this user.
es: Este usuario no tiene productos rastreados.
ru: Этот пользователь не отслеживает товары.

source: Mark as Read
es: Marcar como Leído
ru: Отметить как прочитанное

source: Search & Filter Products
es: Buscar y Filtrar Productos
ru: Поиск и фильтрация товаров

source: Search by Product Name or URL...
es: Buscar por Nombre de Producto o URL...
ru: Поиск по названию товара или URL...

source: All Users
es: Todos los Usuarios
ru: Все пользователи

source: Apply
es: Aplicar
ru: Применить

source: Clear Filters
es: Limpiar Filtros
ru: Очистить фильтры

source: Name
es: Nombre
ru: Название

source: User
es: Usuario
ru: Пользователь

source: Last Checked
es: Última Verificación
ru: Последняя проверка

source: Actions
es: Acciones
ru: Действия

source: N/A
es: N/D
ru: Н/Д

source: Edit
es: Editar
ru: Редактировать

source: Are you sure you want to delete this product?
es: ¿Estás seguro de que deseas eliminar este producto?
ru: Вы уверены, что хотите удалить этот товар?

source: Delete
es: Eliminar
ru: Удалить

source: N/A for MVP
es: N/D para MVP
ru: Н/Д для MVP

source: No products found matching your criteria.
es: No se encontraron productos que coincidan con tus criterios.
ru: Товары, соответствующие вашим критериям, не найдены.

source: Change Email Address
es: Cambiar Dirección de Correo
ru: Изменить адрес email

source: Update your account email address.
es: Actualiza la dirección de correo de tu cuenta.
ru: Обновите адрес email вашего аккаунта.

source: New Email Address
es: Nueva Dirección de Correo
ru: Новый адрес email

source: Your Current Password
es: Tu Contraseña Actual
ru: Ваш текущий пароль

source: Update Email Address
es: Actualizar Dirección de Correo
ru: Обновить адрес email

source: Change Password
es: Cambiar Contraseña
ru: Изменить пароль

source: Update your account password.
es: Actualiza la contraseña de tu cuenta.
ru: Обновите пароль вашего аккаунта.

source: Current Password
es: Contraseña Actual
ru: Текущий пароль

source: Minimum 8 characters
es: Mínimo 8 caracteres
ru: Минимум 8 символов

source: Confirm New Password
es: Confirmar Nueva Contraseña
ru: Подтвердите новый пароль

source: Update Password
es: Actualizar Contraseña
ru: Обновить пароль

source: Invalid Confirmation Link
es: Enlace de Confirmación Inválido
ru: Недействительная ссылка для подтверждения

source: Please request a new confirmation email to verify your account.
es: Por favor solicita un nuevo correo de confirmación para verificar tu cuenta.
ru: Пожалуйста, запросите новое письмо для подтверждения, чтобы верифицировать ваш аккаунт.

source: Go back to
es: Volver a
ru: Вернуться к

source: Login Page
es: Página de Inicio de Sesión
ru: Странице входа

source: Welcome Back
es: Bienvenido de Nuevo
ru: С возвращением

source: Sign in to track your products
es: Inicia sesión para rastrear tus productos
ru: Войдите, чтобы отслеживать ваши товары

source: your@email.com
es: tu@email.com

source: Your password
es: Tu contraseña
ru: Ваш пароль

source: Forgot Password?
es: ¿Olvidaste tu contraseña?
ru: Забыли пароль?

source: Didn't receive a confirmation email?
es: ¿No recibiste el correo de confirmación?
ru: Не получили письмо с подтверждением?

source: Resend it
es: Reenviarlo
ru: Отправить повторно

source: Don't have an account?
es: ¿No tienes una cuenta?
ru: Нет аккаунта?

source: Sign Up
es: Registrarse
ru: Зарегистрироваться

source: your_user_name
es: tu_nombre_de_usuario

source: Minimum 8 characters. Must include uppercase, lowercase, and a digit.
es: Mínimo 8 caracteres. Debe incluir mayúsculas, minúsculas y un dígito.
ru: Минимум 8 символов. Должен включать заглавные и строчные буквы, а также цифру.

source: Repeat your password
es: Repite tu contraseña
ru: Повторите ваш пароль

source: Already have an account?
es: ¿Ya tienes una cuenta?
ru: Уже есть аккаунт?

source: Enter your email address and we will send you a new confirmation link.
es: Ingresa tu dirección de correo y te enviaremos un nuevo enlace de confirmación.
ru: Введите ваш адрес email, и мы отправим вам новую ссылку для подтверждения.

source: Enter your email address to resend the verification link.
es: Ingresa tu dirección de correo para reenviar el enlace de verificación.
ru: Введите ваш адрес email, чтобы повторно отправить ссылку для верификации.

source: Back to Login
es: Volver a Inicio de Sesión
ru: Вернуться к входу

source: Reset Your Password
es: Restablecer tu Contraseña
ru: Сбросить ваш пароль

source: Enter your new password below.
es: Ingresa tu nueva contraseña a continuación.
ru: Введите новый пароль ниже.

source: Repeat New Password
es: Repetir Nueva Contraseña
ru: Повторите новый пароль

source: Back to Sign In
es: Volver a Iniciar Sesión
ru: Вернуться к входу

source: Enter your email to receive a reset link
es: Ingresa tu correo para recibir un enlace de restablecimiento
ru: Введите ваш email, чтобы получить ссылку для сброса

source: Your account has not been confirmed yet.
es: Tu cuenta aún no ha sido confirmada.
ru: Ваш аккаунт еще не подтвержден.

source: Please check your inbox for a confirmation email. If you have not received one, you can request another one.
es: Por favor revisa tu bandeja de entrada para el correo de confirmación. Si no lo has recibido, puedes solicitar otro.
ru: Пожалуйста, проверьте ваш почтовый ящик на наличие письма с подтверждением. Если вы его не получили, вы можете запросить новое.

source: Already confirmed?
es: ¿Ya confirmado?
ru: Уже подтверждено?

source: Password Reset
es: Restablecimiento de Contraseña
ru: Сброс пароля

source: SmartPrice Password Reset
es: Restablecimiento de Contraseña de SmartPrice
ru: Сброс пароля SmartPrice

source: Hello %(username)s,
es: Hola %(username)s,
ru: Здравствуйте, %(username)s,

source: You recently requested to reset your password for your SmartPrice account. Click the button below to reset it.
es: Recientemente solicitaste restablecer tu contraseña para tu cuenta de SmartPrice. Haz clic en el botón de abajo para restablecerla.
ru: Вы недавно запросили сброс пароля для вашего аккаунта SmartPrice. Нажмите кнопку ниже, чтобы сбросить его.

source: This password reset link will expire in %(hours)d hours.
es: Este enlace de restablecimiento de contraseña expirará en %(hours)d horas.
ru: Эта ссылка для сброса пароля истечет через %(hours)d часов.

source: If you didn't request a password reset, please ignore this email or contact support if you have questions.
es: Si no solicitaste un restablecimiento de contraseña, por favor ignora este correo o contacta al soporte si tienes preguntas.
ru: Если вы не запрашивали сброс пароля, пожалуйста, проигнорируйте это письмо или свяжитесь с поддержкой, если у вас есть вопросы.

source: Thanks,
es: Gracias,
ru: Спасибо,

source: %(name)s Edit
es: Editar %(name)s
ru: Редактирование %(name)s

source: Save
es: Guardar
ru: Сохранить

source: Sincerely,
es: Atentamente,
ru: С уважением,

source: You received this email because you are tracking products on SmartPrice.
es: Recibiste este correo porque estás rastreando productos en SmartPrice.
ru: Вы получили это письмо, потому что отслеживаете товары на SmartPrice.

source: Confirm Your New Email Address
es: Confirma tu Nueva Dirección de Correo
ru: Подтвердите ваш новый адрес email

source: Hi %(username)s,
es: Hola %(username)s,
ru: Привет, %(username)s,

source: You requested to change the email address for your SmartPrice account. To confirm this change, please click the button below.
es: Solicitaste cambiar la dirección de correo de tu cuenta de SmartPrice. Para confirmar este cambio, por favor haz clic en el botón de abajo.
ru: Вы запросили изменение адреса email для вашего аккаунта SmartPrice. Чтобы подтвердить это изменение, пожалуйста, нажмите кнопку ниже.

source: Confirm New Email
es: Confirmar Nuevo Correo
ru: Подтвердить новый email

source: If you did not request this change, please ignore this email or contact our support.
es: Si no solicitaste este cambio, por favor ignora este correo o contacta a nuestro soporte.
ru: Если вы не запрашивали это изменение, пожалуйста, проигнорируйте это письмо или свяжитесь с нашей поддержкой.

source: Confirm Your Account
es: Confirma tu Cuenta
ru: Подтвердите ваш аккаунт

source: Thanks for signing up for SmartPrice! To complete your registration, please click the button below to verify your email address.
es: ¡Gracias por registrarte en SmartPrice! Para completar tu registro, por favor haz clic en el botón de abajo para verificar tu dirección de correo.
ru: Спасибо за регистрацию в SmartPrice! Чтобы завершить регистрацию, пожалуйста, нажмите кнопку ниже, чтобы подтвердить ваш адрес email.

source: Verify My Email
es: Verificar mi Correo
ru: Подтвердить мой email

source: This link will expire in %(hours)s hours.
es: Este enlace expirará en %(hours)s horas.
ru: Эта ссылка истечет через %(hours)s часов.

source: If you did not sign up for an account, you can safely ignore this email.
es: Si no te registraste para una cuenta, puedes ignorar este correo con seguridad.
ru: Если вы не регистрировались, вы можете спокойно проигнорировать это письмо.

source: Welcome to SmartPrice, %(username)s!
es: ¡Bienvenido a SmartPrice, %(username)s!
ru: Добро пожаловать в SmartPrice, %(username)s!

source: We are thrilled to have you on board. You are now ready to start tracking prices and saving money.
es: Estamos encantados de tenerte a bordo. Ahora estás listo para comenzar a rastrear precios y ahorrar dinero.
ru: Мы рады приветствовать вас на борту. Теперь вы готовы начать отслеживать цены и экономить деньги.

source: Here are a few things you can do to get started:
es: Aquí hay algunas cosas que puedes hacer para comenzar:
ru: Вот несколько шагов, чтобы начать:

source: Track your first product from your favorite online store.
es: Rastrea tu primer producto de tu tienda en línea favorita.
ru: Начните отслеживать свой первый товар из вашего любимого интернет-магазина.

source: Set up your notification preferences in your profile.
es: Configura tus preferencias de notificación en tu perfil.
ru: Настройте предпочтения уведомлений в вашем профиле.

source: Connect your Telegram account for instant alerts.
es: Conecta tu cuenta de Telegram para alertas instantáneas.
ru: Подключите ваш аккаунт Telegram для мгновенных уведомлений.

source: Track Your First Product
es: Rastrea tu Primer Producto
ru: Отслеживайте ваш первый товар

source: Good news, %(username)s! The price has dropped for a product you are tracking.
es: ¡Buenas noticias, %(username)s! El precio ha bajado para un producto que estás rastreando.
ru: Хорошие новости, %(username)s! Цена на отслеживаемый вами товар упала.

source: View on Store
es: Ver en la Tienda
ru: Посмотреть в магазине

source: Hi %(username)s, just a heads-up: the price has increased for a product you are tracking.
es: Hola %(username)s, solo un aviso: el precio ha aumentado para un producto que estás rastreando.
ru: Привет, %(username)s, небольшое предупреждение: цена на отслеживаемый вами товар выросла.

source: Was:
es: Era:
ru: Было:

source: Amazing news, %(username)s! A product you are tracking has reached your target price.
es: ¡Increíbles noticias, %(username)s! Un producto que estás rastreando ha alcanzado tu precio objetivo.
ru: Потрясающие новости, %(username)s! Товар, который вы отслеживаете, достиг вашей целевой цены.

source: Target:
es: Objetivo:
ru: Цель:

source: Buy Now
es: Comprar Ahora
ru: Купить сейчас

source: 403 - Access Denied
es: 403 - Acceso Denegado
ru: 403 - Доступ запрещен

source: You shall not pass!
es: ¡No pasarás!
ru: Вы не пройдете!

source: Our digital bouncers have determined you don't have the proper credentials.
es: Nuestros porteros digitales han determinado que no tienes las credenciales adecuadas.
ru: Наши цифровые вышибалы определили, что у вас нет необходимых полномочий.

source: If you believe this is a mistake, please contact support.
es: Si crees que esto es un error, por favor contacta al soporte.
ru: Если вы считаете, что это ошибка, пожалуйста, свяжитесь с поддержкой.

source: Return Home
es: Volver al Inicio
ru: Вернуться на главную

source: Contact Support
es: Contactar Soporte
ru: Связаться с поддержкой

source: Fun fact: The average developer spends 403 minutes per week debugging permission issues.
es: Dato curioso: El desarrollador promedio pasa 403 minutos por semana depurando problemas de permisos.
ru: Интересный факт: Средний разработчик тратит 403 минуты в неделю на отладку проблем с правами доступа.

source: 404 - Mission Control, We Have a Problem
es: 404 - Control de Misión, Tenemos un Problema
ru: 404 - Центр управления, у нас проблема

source: Houston, this page has left the atmosphere!
es: ¡Houston, esta página ha dejado la atmósfera!
ru: Хьюстон, эта страница покинула атмосферу!

source: Our team of highly trained monkeys (and developers) can't find this page.
es: Nuestro equipo de monos altamente entrenados (y desarrolladores) no puede encontrar esta página.
ru: Наша команда высококвалифицированных обезьян (и разработчиков) не может найти эту страницу.

source: Maybe it was abducted by aliens, or you mistyped the URL?
es: ¿Quizás fue abducida por aliens, o escribiste mal la URL?
ru: Может, ее похитили инопланетяне, или вы ошиблись в URL?

source: Beam Me Home
es: Transpórtame a Casa
ru: Вернуть меня домой

source: Call for Backup
es: Llamar a Refuerzos
ru: Вызвать подкрепление

source: Fun fact: The number 404 is actually how many cups of coffee our developers drink daily.
es: Dato curioso: El número 404 es en realidad cuántas tazas de café nuestros desarrolladores beben diariamente.
ru: Интересный факт: Число 404 — это количество чашек кофе, которые наши разработчики выпивают ежедневно.

source: 500 - Our Robots Have Rebelled
es: 500 - Nuestros Robots se Han Rebelado
ru: 500 - Наши роботы взбунтовались

source: The machines have taken over... temporarily
es: Las máquinas han tomado el control... temporalmente
ru: Машины захватили власть... временно

source: Our server is currently experiencing an existential crisis.
es: Nuestro servidor está experimentando actualmente una crisis existencial.
ru: Наш сервер сейчас переживает экзистенциальный кризис.

source: While we negotiate with our AI overlords, why don't you:
es: Mientras negociamos con nuestros señores de IA, ¿por qué no:
ru: Пока мы договариваемся с нашими ИИ-владыками, почему бы вам не:

source: Refresh the page (the classic IT solution)
es: Actualizar la página (la solución clásica de TI)
ru: Обновить страницу (классическое ИТ-решение)

source: Pet a dog/cat for emotional support
es: Acaricia un perro/gato para apoyo emocional
ru: Погладить собаку/кошку для эмоциональной поддержки

source: Try again in a few minutes
es: Intenta de nuevo en unos minutos
ru: Попробовать снова через несколько минут

source: Return to Safety
es: Volver a la Seguridad
ru: Вернуться в безопасное место

source: Emergency Distraction
es: Distracción de Emergencia
ru: Экстренное отвлечение

source: Meanwhile, our developers are frantically googling "how to appease robot overlords".
es: Mientras tanto, nuestros desarrolladores están buscando frenéticamente en Google "cómo apaciguar a los señores robot".
ru: Тем временем наши разработчики лихорадочно ищут в Google "как умилостивить роботизированных владык".

source: SmartPrice: Never Miss a Deal Again!
es: SmartPrice: ¡Nunca Pierdas una Oferta de Nuevo!
ru: SmartPrice: Никогда не пропустите выгодную сделку!

source: Track product prices effortlessly and save money on your online shopping. We watch, you save!
es: Rastrea precios de productos sin esfuerzo y ahorra dinero en tus compras en línea. ¡Nosotros vigilamos, tú ahorras!
ru: Отслеживайте цены на товары без усилий и экономьте на онлайн-покупках. Мы следим, вы экономите!

source: Get Started for Free
es: Comienza Gratis
ru: Начать бесплатно

source: Go to My Products
es: Ir a Mis Productos
ru: Перейти к моим товарам

source: Tired of manually checking if that wishlist item finally dropped in price? SmartPrice is your personal shopping assistant that automates price tracking across your favorite online stores. Set your desired price, and we’ll notify you the moment it hits your target or drops significantly. Shop smarter, not harder!
es: ¿Cansado de verificar manualmente si ese artículo de tu lista de deseos finalmente bajó de precio? SmartPrice es tu asistente de compras personal que automatiza el seguimiento de precios en tus tiendas en línea favoritas. Establece tu precio deseado y te notificaremos en el momento en que alcance tu objetivo o baje significativamente. ¡Compra de manera más inteligente, no más difícil!
ru: Надоело вручную проверять, снизилась ли цена на товар из вашего списка желаний? SmartPrice — ваш личный помощник по покупкам, который автоматизирует отслеживание цен в ваших любимых интернет-магазинах. Установите желаемую цену, и мы уведомим вас, как только она достигнет цели или значительно снизится. Покупайте умнее, а не сложнее!

source: Just paste the product URL, set your target price, and let us do the heavy lifting. Supports a growing list of popular stores.
es: Solo pega la URL del producto, establece tu precio objetivo y déjanos hacer el trabajo pesado. Soporta una lista creciente de tiendas populares.
ru: Просто вставьте URL товара, установите целевую цену, и мы сделаем всю тяжелую работу. Поддерживается растущий список популярных магазинов.

source: Receive alerts via email, Telegram, or directly in your account dashboard when a price meets your criteria.
es: Recibe alertas por correo, Telegram o directamente en el panel de tu cuenta cuando un precio cumpla con tus criterios.
ru: Получайте уведомления по email, Telegram или прямо в вашем личном кабинете, когда цена соответствует вашим критериям.

source: Price History
es: Historial de Precios
ru: История цен

source: Visualize price trends over time to make even more informed purchasing decisions. Know the best time to buy!
es: Visualiza las tendencias de precios a lo largo del tiempo para tomar decisiones de compra aún más informadas. ¡Conoce el mejor momento para comprar!
ru: Визуализируйте ценовые тенденции с течением времени, чтобы принимать более обоснованные решения о покупке. Знайте лучшее время для покупки!

source: Multi-Language Support
es: Soporte Multilingüe
ru: Поддержка нескольких языков

source: Use SmartPrice in your preferred language. We currently support English, Russian, Spanish, and Chinese.
es: Usa SmartPrice en tu idioma preferido. Actualmente soportamos inglés, ruso, español y chino.
ru: Используйте SmartPrice на предпочитаемом языке. Мы поддерживаем английский, русский, испанский и китайский.

source: Accessible Anywhere
es: Accesible desde cualquier lugar
ru: Доступно везде

source: Our web application is designed to work seamlessly on your desktop, tablet, or smartphone.
es: Nuestra aplicación web está diseñada para funcionar sin problemas en tu escritorio, tableta o smartphone.
ru: Наше веб-приложение разработано для бесперебойной работы на вашем компьютере, планшете или смартфоне.

source: Secure & Private
es: Seguro y privado
ru: Безопасно и конфиденциально

source: Your data privacy is important to us. We only track what you ask us to and keep your information secure.
es: La privacidad de tus datos es importante para nosotros. Solo rastreamos lo que nos pides y mantenemos tu información segura.
ru: Конфиденциальность ваших данных важна для нас. Мы отслеживаем только то, что вы просите, и сохраняем вашу информацию в безопасности.

source: Simple Steps to Savings
es: Pasos sencillos para ahorrar
ru: Простые шаги к экономии

source: Copy the URL of the product you want to track from an online store and paste it into SmartPrice.
es: Copia la URL del producto que deseas rastrear desde una tienda en línea y pégala en SmartPrice.
ru: Скопируйте URL товара, который вы хотите отслеживать, из интернет-магазина и вставьте его в SmartPrice.

source: Tell us the price you’re willing to pay. You can also opt for general price drop notifications.
es: Dinos el precio que estás dispuesto a pagar. También puedes optar por notificaciones generales de bajada de precio.
ru: Укажите цену, которую вы готовы заплатить. Вы также можете выбрать уведомления о любом снижении цены.

source: Get Notified & Save
es: Recibe notificaciones y ahorra
ru: Получайте уведомления и экономьте

source: Relax! We’ll monitor the price and send you an alert when it’s time to buy and save money.
es: ¡Relájate! Nosotros monitorearemos el precio y te enviaremos una alerta cuando sea el momento de comprar y ahorrar dinero.
ru: Расслабьтесь! Мы будем следить за ценой и отправим вам уведомление, когда придет время покупать и экономить.

source: We are constantly expanding our list of supported online retailers. Currently, you can track prices on:
es: Estamos constantemente ampliando nuestra lista de minoristas en línea soportados. Actualmente, puedes rastrear precios en:
ru: Мы постоянно расширяем список поддерживаемых интернет-магазинов. В настоящее время вы можете отслеживать цены на:

source: Many more coming soon!
es: ¡Muchas más pronto!
ru: Скоро появится еще больше!

source: What Our Users Say
es: Qué dicen nuestros usuarios
ru: Что говорят наши пользователи
