Repository: LilyAshford/smartprice
Catalog: app/locales/*/LC_MESSAGES/messages.po
Languages: es, ru

source: Bug Report
es: Reporte de Error
ru: Сообщение об ошибке

source: Suggestion
es: Sugerencia
ru: Предложение

source: Praise
es: Elogio

source: Other
es: Otro
ru: Другое

source: View Product
es: Ver Producto
ru: Просмотреть товар

source: Check Product
es: Verificar Producto
ru: Проверить товар

source: Details
es: Detalles
ru: Подробности

source: Email or Username
es: Correo Electrónico o Nombre de Usuario
ru: Email или имя пользователя

source: Password
es: Contraseña
ru: Пароль

source: Remember Me
es: Recordarme
ru: Запомнить меня

source: Sign In
es: Iniciar Sesión
ru: Войти

source: Email
es: Correo Electrónico

source: Send
es: Enviar
ru: Отправить

source: Username
es: Nombre de Usuario
ru: Имя пользователя

source: Username may contain international characters, numbers, dots, underscores and hyphens
es: El nombre de usuario puede contener caracteres internacionales, números, puntos, guiones bajos y guiones
ru: Имя пользователя может содержать международные символы, цифры, точки, подчеркивания и дефисы

source: Password must be at least 8 characters
es: La contraseña debe tener al menos 8 caracteres
ru: Пароль должен содержать не менее 8 символов

source: Repeat Password
es: Repetir Contraseña
ru: Повторите пароль

source: Passwords must match
es: Las contraseñas deben coincidir
ru: Пароли должны совпадать

source: Register
es: Registrarse
ru: Зарегистрироваться

source: Request Password Reset
es: Solicitar Restablecimiento de Contraseña
ru: Запросить сброс пароля

source: New Password
es: Nueva Contraseña
ru: Новый пароль

source: Reset Password
es: Restablecer Contraseña
ru: Сбросить пароль

source: Resend Verification Email
es: Reenviar Correo de Verificación
ru: Повторно отправить письмо для подтверждения

source: Your account has not been confirmed. Please check your email or <a href="%(url)s" class="alert-link">resend the confirmation link</a>.
es: Tu cuenta no ha sido confirmada. Por favor revisa tu correo electrónico o <a href="%(url)s" class="alert-link">reenvía el enlace de confirmación</a>.
ru: Ваш аккаунт не подтвержден. Пожалуйста, проверьте вашу почту или <a href="%(url)s" class="alert-link">повторно отправьте ссылку для подтверждения</a>.

source: Your account is disabled
es: Tu cuenta está deshabilitada
ru: Ваш аккаунт отключен

source: Invalid email or password
es: Correo electrónico o contraseña inválidos
ru: Неверный email или пароль

source: Login
es: Iniciar Sesión
ru: Вход

source: Email already registered
es: Correo electrónico ya registrado
ru: Email уже зарегистрирован

source: Registration successful! A confirmation email has been sent to you. Please check your inbox (and spam folder!) to activate your account.
es: ¡Registro exitoso! Se ha enviado un correo de confirmación. Por favor revisa tu bandeja de entrada (¡y la carpeta de spam!) para activar tu cuenta.
ru: Регистрация прошла успешно! Письмо с подтверждением отправлено на вашу почту. Пожалуйста, проверьте входящие (и папку спама!) для активации аккаунта.

source: Emails can sometimes take a few minutes to arrive. Please be patient.
es: Los correos electrónicos pueden tardar algunos minutos en llegar. Por favor ten paciencia.
ru: Письма иногда могут приходить с задержкой в несколько минут. Пожалуйста, подождите.

source: Something went wrong!
es: ¡Algo salió mal!
ru: Что-то пошло не так!

source: User already exists!.
es: ¡El usuario ya existe!
ru: Пользователь уже существует!

source: Invalid Entry
es: Entrada inválida
ru: Неверные данные

source: Error connecting to the database
es: Error al conectar con la base de datos
ru: Ошибка подключения к базе данных

source: An error occurred!
es: ¡Ocurrió un error!
ru: Произошла ошибка!

source: Registration failed. Please try again.
es: Registro fallido. Por favor inténtalo de nuevo.
ru: Регистрация не удалась. Пожалуйста, попробуйте снова.

source: This account is already confirmed. Please log in.
es: Esta cuenta ya está confirmada. Por favor inicia sesión.
ru: Этот аккаунт уже подтвержден. Пожалуйста, войдите.

source: A new confirmation email has been sent to your email address.
es: Se ha enviado un nuevo correo de confirmación a tu dirección de correo.
ru: Новое письмо с подтверждением отправлено на ваш email.

source: No account found with that email address.
es: No se encontró ninguna cuenta con esa dirección de correo.
ru: Аккаунт с таким email не найден.

source: Resend Confirmation Email
es: Reenviar Correo de Confirmación
ru: Повторно отправить письмо для подтверждения

source: Your account is already confirmed.
es: Tu cuenta ya está confirmada.
ru: Ваш аккаунт уже подтвержден.

source: The confirmation link is invalid or has expired.
es: El enlace de confirmación es inválido o ha expirado.
ru: Ссылка для подтверждения недействительна или истек срок ее действия.

source: Confirmation Failed
es: Confirmación Fallida
ru: Подтверждение не удалось

source: You have confirmed your account. A welcome email has been sent. Thanks!
es: Has confirmado tu cuenta. Se ha enviado un correo de bienvenida. ¡Gracias!
ru: Вы подтвердили свой аккаунт. Приветственное письмо отправлено. Спасибо!

source: You have confirmed your account. Thanks! You can now log in.
es: Has confirmado tu cuenta. ¡Gracias! Ahora puedes iniciar sesión.
ru: Вы подтвердили свой аккаунт. Спасибо! Теперь вы можете войти.

source: Failed to confirm your account. The link might be invalid or an error occurred.
es: Fallo al confirmar tu cuenta. El enlace podría ser inválido o ocurrió un error.
ru: Не удалось подтвердить ваш аккаунт. Ссылка может быть недействительной или произошла ошибка.

source: A new confirmation email has been sent. Please check your inbox and spam folder.
es: Se ha enviado un nuevo correo de confirmación. Por favor revisa tu bandeja de entrada y carpeta de spam.
ru: Новое письмо с подтверждением отправлено. Пожалуйста, проверьте входящие и папку спама.

source: Your password has been updated.
es: Tu contraseña ha sido actualizada.
ru: Ваш пароль обновлен.

source: Invalid password.
es: Contraseña inválida.
ru: Неверный пароль.

source: You have been logged out.
es: Has cerrado sesión.
ru: Вы вышли из системы.

source: An email with instructions to reset your password has been sent. Please check your inbox and spam folder.
es: Se ha enviado un correo con instrucciones para restablecer tu contraseña. Por favor revisa tu bandeja de entrada y carpeta de spam.
ru: Письмо с инструкциями по сбросу пароля отправлено. Пожалуйста, проверьте входящие и папку спама.

source: Error sending email. Please try again later.
es: Error al enviar el correo. Por favor inténtalo más tarde.
ru: Ошибка при отправке письма. Пожалуйста, попробуйте снова позже.

source: If this email exists in our system, you will receive a password reset link
es: Si este correo existe en nuestro sistema, recibirás un enlace para restablecer tu contraseña
ru: Если этот email зарегистрирован в нашей системе, вы получите ссылку для сброса пароля

source: This password reset link is invalid or has expired. Please request a new one.
es: Este enlace para restablecer contraseña es inválido o ha expirado. Por favor solicita uno nuevo.
ru: Эта ссылка для сброса пароля недействительна или истек срок ее действия. Пожалуйста, запросите новую.

source: Your password has been updated! You can now log in.
es: ¡Tu contraseña ha sido actualizada! Ahora puedes iniciar sesión.
ru: Ваш пароль обновлен! Теперь вы можете войти.

source: An unexpected error occurred. Please try again.
es: Ocurrió un error inesperado. Por favor inténtalo de nuevo.
ru: Произошла непредвиденная ошибка. Пожалуйста, попробуйте снова.

source: Confirm your email address
es: Confirma tu dirección de correo electrónico
ru: Подтвердите ваш email

source: An email with instructions to confirm your new email address has been sent to you
es: Se te ha enviado un correo con instrucciones para confirmar tu nueva dirección de correo electrónico
ru: Письмо с инструкциями по подтверждению нового адреса email отправлено вам

source: Invalid email or password.
es: Correo electrónico o contraseña inválidos.
ru: Неверный email или пароль.

source: Your email address has been updated! Please log in with your new email.
es: ¡Tu dirección de correo ha sido actualizada! Por favor inicia sesión con tu nuevo correo.
ru: Ваш адрес email обновлен! Пожалуйста, войдите с новым email.

source: Invalid request. Please try again
es: Solicitud inválida. Por favor inténtalo de nuevo
ru: Неверный запрос. Пожалуйста, попробуйте снова

source: Verify Your SmartPrice Account
es: Verifica Tu Cuenta de SmartPrice
ru: Подтвердите ваш аккаунт SmartPrice

source: New Feedback Received on SmartPrice
es: Nuevo Comentario Recibido en SmartPrice
ru: Получен новый отзыв на SmartPrice

source: 🎯 Price for "%(name)s" reached your target!
es: 🎯 ¡El precio de "%(name)s" alcanzó tu objetivo!
ru: 🎯 Цена на "%(name)s" достигла вашей цели!

source: Current Price: %(new_price)s$. Target: %(target)s$.
es: Precio Actual: %(new_price)s$. Objetivo: %(target)s$.
ru: Текущая цена: %(new_price)s$. Цель: %(target)s$.

source: 📉 Price dropped for "%(name)s" to %(new_price)s$!
es: 📉 ¡El precio de "%(name)s" bajó a %(new_price)s$!
ru: 📉 Цена на "%(name)s" упала до %(new_price)s$!

source: Previous price was %(old_price)s$.
es: El precio anterior era %(old_price)s$.
ru: Предыдущая цена была %(old_price)s$.

source: Message from Admin
es: Mensaje del Administrador
ru: Сообщение от администратора

source: 🎉 Your Savings Report for %(period)s is here!
es: 🎉 ¡Tu Informe de Ahorros para %(period)s está aquí!
ru: 🎉 Ваш отчет об экономии за %(period)s здесь!

source: You've saved approximately %(amount)s$ with SmartPrice. Keep tracking!
es: Has ahorrado aproximadamente %(amount)s$ con SmartPrice. ¡Sigue rastreando!
ru: Вы сэкономили примерно %(amount)s$ с SmartPrice. Продолжайте отслеживать!

source: 🎯 Price Alert! "%(name)s" reached your target price!
es: 🎯 ¡Alerta de Precio! "%(name)s" alcanzó tu precio objetivo!
ru: 🎯 Оповещение о цене! "%(name)s" достиг вашей целевой цены!

source: 📉 Price Drop for "%(name)s"!
es: 📉 ¡Bajada de Precio para "%(name)s"!
ru: 📉 Снижение цены на "%(name)s"!

source: 📈 Price Increase for "%(name)s"!
es: 📈 ¡Aumento de Precio para "%(name)s"!
ru: 📈 Повышение цены на "%(name)s"!

source: You must select at least one notification method
es: Debes seleccionar al menos un método de notificación
ru: Вы должны выбрать хотя бы один способ уведомления

source: Product URL
es: URL del Producto
ru: URL товара

source: Product Name (optional)
es: Nombre del Producto (opcional)
ru: Название товара (необязательно)

source: Target Price ($)
es: Precio Objetivo ($)
ru: Целевая цена ($)

source: Also, notify if price just drops by ($)
es: También notificar si el precio baja en ($)
ru: Также уведомлять, если цена упадет на ($)

source: For example, enter 5 to get a notification for any price drop of $5 or more. Leave it blank to get a notification for any, even the slightest, drop.
es: Por ejemplo, ingresa 5 para recibir una notificación por cualquier bajada de $5 o más. Déjalo en blanco para recibir notificaciones por cualquier bajada, incluso las más pequeñas.
ru: Например, введите 5, чтобы получать уведомления о снижении цены на $5 или больше. Оставьте поле пустым, чтобы получать уведомления о любом, даже самом незначительном, снижении.

source: And notify if price increases by ($)
es: Y notificar si el precio sube en ($)
ru: И уведомлять, если цена вырастет на ($)

source: Useful if you want to know when the price has returned to its previous level. Leave blank to not receive notifications about increases.
es: Útil si quieres saber cuando el precio vuelve a su nivel anterior. Déjalo en blanco para no recibir notificaciones sobre aumentos.
ru: Полезно, если вы хотите знать, когда цена вернется к предыдущему уровню. Оставьте пустым, чтобы не получать уведомления о повышении.

source: Notification Methods
es: Métodos de Notificación
ru: Способы уведомления

source: Account notifications
es: Notificaciones en la cuenta
ru: Уведомления в аккаунте

source: Check Frequency
es: Frecuencia de Verificación
ru: Частота проверки

source: Once a week
es: Una vez por semana
ru: Раз в неделю

source: Could not extract any data from the product page.
es: No se pudo extraer ningún dato de la página del producto.
ru: Не удалось извлечь данные со страницы товара.

source: Could not parse product page. Please check the URL and/or try one more time.
es: No se pudo analizar la página del producto. Por favor verifica la URL y/o inténtalo una vez más.
ru: Не удалось разобрать страницу товара. Пожалуйста, проверьте URL и/или попробуйте еще раз.

source: Could not determine a valid price from the product page.
es: No se pudo determinar un precio válido de la página del producto.
ru: Не удалось определить действительную цену на странице товара.

source: Mock product added. A test notification has been queued! Check your notifications in a minute.
es: Producto simulado añadido. ¡Una notificación de prueba ha sido encolada! Revisa tus notificaciones en un minuto.
ru: Тестовый товар добавлен. Тестовое уведомление поставлено в очередь! Проверьте уведомления через минуту.

source: Product "%(name)s" added for tracking! We will notify you when the price drops below %(price)s
es: ¡Producto "%(name)s" añadido para seguimiento! Te notificaremos cuando el precio baje de %(price)s
ru: Товар "%(name)s" добавлен для отслеживания! Мы уведомим вас, когда цена упадёт ниже %(price)s

source: Sorry, we could not save the product at this time. Please try again later.
es: Lo sentimos, no pudimos guardar el producto en este momento. Por favor inténtalo más tarde.
ru: К сожалению, мы не смогли сохранить товар в данный момент. Пожалуйста, попробуйте снова позже.

source: Error adding product: %(error)s
es: Error al añadir producto: %(error)s
ru: Ошибка при добавлении товара: %(error)s

source: Track New Product
es: Rastrear Nuevo Producto
ru: Отслеживать новый товар

source: Email notifications have been enabled for your account.
es: Las notificaciones por correo han sido habilitadas para tu cuenta.
ru: Уведомления по email включены для вашего аккаунта.

source: Failed to add product. Possibly it's already tracked or missing required fields.
es: Fallo al añadir producto. Posiblemente ya está siendo rastreado o faltan campos requeridos.
ru: Не удалось добавить товар. Возможно, он уже отслеживается или отсутствуют обязательные поля.

source: Product "%(name)s" added for tracking!
es: ¡Producto "%(name)s" añadido para seguimiento!
ru: Товар "%(name)s" добавлен для отслеживания!

source: Unexpected server error. Please try again later.
es: Error inesperado del servidor. Por favor inténtalo más tarde.
ru: Непредвиденная ошибка сервера. Пожалуйста, попробуйте снова позже.

source: This product is already being tracked
es: Este producto ya está siendo rastreado
ru: Этот товар уже отслеживается

source: This product is already being tracked.
es: Este producto ya está siendo rastreado.
ru: Этот товар уже отслеживается.

source: Target price has already been reached! A notification has been sent.
es: ¡El precio objetivo ya ha sido alcanzado! Se ha enviado una notificación.
ru: Целевая цена уже достигнута! Уведомление отправлено.

source: There was a database error. It seems this product is already tracked.
es: Hubo un error en la base de datos. Parece que este producto ya está siendo rastreado.
ru: Произошла ошибка базы данных. Похоже, этот товар уже отслеживается.

source: An unexpected error occurred while adding the product.
es: Ocurrió un error inesperado al añadir el producto.
ru: Произошла непредвиденная ошибка при добавлении товара.

source: Username must be between 3 and 20 characters.
es: El nombre de usuario debe tener entre 3 y 20 caracteres.
ru: Имя пользователя должно содержать от 3 до 20 символов.

source: Usernames must start with a letter and have only letters, numbers, dots or underscores
es: Los nombres de usuario deben comenzar con una letra y solo contener letras, números, puntos o guiones bajos
ru: Имя пользователя должно начинаться с буквы и содержать только буквы, цифры, точки или подчеркивания

source: Update Username
es: Actualizar Nombre de Usuario
ru: Обновить имя пользователя

source: This username is already taken.
es: Este nombre de usuario ya está en uso.
ru: Это имя пользователя уже занято.

source: Enable Target Price Reached Notifications
es: Habilitar Notificaciones de Precio Objetivo Alcanzado
ru: Включить уведомления о достижении целевой цены

source: Chat ID must be a number (can be negative for groups).
es: El ID de Chat debe ser un número (puede ser negativo para grupos).
ru: ID чата должен быть числом (может быть отрицательным для групп).

source: Interface Display Language
es: Idioma de la Interfaz
ru: Язык интерфейса

source: English
es: Inglés
ru: Английский

source: Russian
es: Ruso
ru: Русский

source: Spanish
es: Español
ru: Испанский

source: Chinese
es: Chino
ru: Китайский

source: Change Interface Language
es: Cambiar Idioma de la Interfaz
ru: Изменить язык интерфейса

source: Category
es: Categoría
ru: Категория

source: Your Message
es: Tu Mensaje
ru: Ваше сообщение

source: Send Feedback
es: Enviar Comentarios
ru: Отправить отзыв

source: Update Product
es: Actualizar Producto
ru: Обновить товар

source: Please confirm your account to access full profile features.
es: Por favor confirma tu cuenta para acceder a todas las funciones del perfil.
ru: Пожалуйста, подтвердите ваш аккаунт, чтобы получить доступ ко всем функциям профиля.

source: Your Profile
es: Tu Perfil
ru: Ваш профиль

source: Product "%(name)s" has been successfully deleted.
es: Producto "%(name)s" ha sido eliminado exitosamente.
ru: Товар "%(name)s" успешно удален.

source: Failed to delete product.
es: Fallo al eliminar producto.
ru: Не удалось удалить товар.

source: Your username has been updated!
es: ¡Tu nombre de usuario ha sido actualizado!
ru: Ваше имя пользователя обновлено!

source: This username is already taken. Please choose another.
es: Este nombre de usuario ya está en uso. Por favor elige otro.
ru: Это имя пользователя уже занято. Пожалуйста, выберите другое.

source: An error occurred while updating your username.
es: Ocurrió un error al actualizar tu nombre de usuario.
ru: Произошла ошибка при обновлении вашего имени пользователя.

source: Username is the same, no changes made.
es: El nombre de usuario es el mismo, no se realizaron cambios.
ru: Имя пользователя не изменилось, изменения не внесены.

source: An error occurred while saving notification settings.
es: Ocurrió un error al guardar la configuración de notificaciones.
ru: Произошла ошибка при сохранении настроек уведомлений.

source: Interface language updated and saved to your profile!
es: ¡Idioma de la interfaz actualizado y guardado en tu perfil!
ru: Язык интерфейса обновлен и сохранен в вашем профиле!

source: Could not save language preference to profile.
es: No se pudo guardar la preferencia de idioma en el perfil.
ru: Не удалось сохранить языковые настройки в профиле.

source: Interface language updated for this session!
es: ¡Idioma de la interfaz actualizado para esta sesión!
ru: Язык интерфейса обновлен для этой сессии!

source: Invalid language selected.
es: Idioma seleccionado inválido.
ru: Выбран неверный язык.

source: Thank you for your feedback! We appreciate you helping us improve SmartPrice.
es: ¡Gracias por tus comentarios! Apreciamos que nos ayudes a mejorar SmartPrice.
ru: Спасибо за ваш отзыв! Мы ценим вашу помощь в улучшении SmartPrice.

source: Sorry, there was an issue submitting your feedback. Please try again later.
es: Lo sentimos, hubo un problema al enviar tus comentarios. Por favor inténtalo más tarde.
ru: К сожалению, возникла проблема с отправкой вашего отзыва. Пожалуйста, попробуйте снова позже.

source: Leave Feedback
es: Dejar Comentarios
ru: Оставить отзыв

source: Product "%(name)s" updated successfully!
es: ¡Producto "%(name)s" actualizado exitosamente!
ru: Товар "%(name)s" успешно обновлен!

source: All notifications have been cleared.
es: Todas las notificaciones han sido limpiadas.
ru: Все уведомления очищены.

source: An error occurred while clearing notifications.
es: Ocurrió un error al limpiar las notificaciones.
ru: Произошла ошибка при очистке уведомлений.

source: Admin Panel
es: Panel de Administración
ru: Панель администратора

source: Profile
es: Perfil
ru: Профиль

source: Logout
es: Cerrar Sesión
ru: Выйти

source: Track prices and save money!
es: ¡Rastrea precios y ahorra dinero!
ru: Отслеживайте цены и экономьте деньги!

source: Add Product to Track
es: Añadir Producto para Rastrear
ru: Добавить товар для отслеживания

source: Go to the product page
es: Ir a la página del producto
ru: Перейдите на страницу товара

source: Navigate to the product you want to track on the supported website
es: Navega al producto que deseas rastrear en el sitio web soportado
ru: Перейдите на страницу товара, который вы хотите отслеживать, на поддерживаемом сайте

source: Copy the address
es: Copiar la dirección
ru: Скопируйте адрес

source: Highlight and copy the entire URL from your browser's address bar
es: Resalta y copia toda la URL de la barra de direcciones de tu navegador
ru: Выделите и скопируйте полный URL из адресной строки браузера

source: URL example
es: Ejemplo de URL
ru: Пример URL

source: Paste it here
es: Pégalo aquí
ru: Вставьте сюда

source: Make sure the URL starts with https:// and contains the product details
es: Asegúrate de que la URL comience con https:// y contenga los detalles del producto
ru: Убедитесь, что URL начинается с https:// и содержит информацию о товаре

source: Start Tracking
es: Comenzar Seguimiento
ru: Начать отслеживание

source: Never miss a deal! Get real-time notifications when prices drop below your target, so you can buy at the perfect moment.
es: ¡Nunca pierdas una oferta! Recibe notificaciones en tiempo real cuando los precios bajen de tu objetivo, para que puedas comprar en el momento perfecto.
ru: Не упустите выгодную сделку! Получайте уведомления в реальном времени, когда цены падают ниже вашей цели, чтобы купить в идеальный момент.

source: Track price trends over time to make smarter purchasing decisions with confidence.
es: Rastrea las tendencias de precios a lo largo del tiempo para tomar decisiones de compra más inteligentes con confianza.
ru: Отслеживайте ценовые тенденции с течением времени, чтобы принимать более обоснованные решения о покупке.

source: Stay informed your way—choose Email, Telegram, or Account Inbox for seamless price updates.
es: Mantente informado a tu manera—elige Correo, Telegram o Bandeja de Cuenta para actualizaciones de precios sin problemas.
ru: Будьте в курсе по-своему — выбирайте уведомления по email, Telegram или в личном кабинете для удобных обновлений цен.

source: Email notifications are disabled in your account settings. Do you want to enable them for this product?
es: Las notificaciones por correo están deshabilitadas en la configuración de tu cuenta. ¿Deseas habilitarlas para este producto?
ru: Уведомления по email отключены в настройках вашего аккаунта. Хотите включить их для этого товара?

source: Yes
es: Sí
ru: Да

source: No notification methods selected. Add at least one (except email) or enable email in settings.
es: No se han seleccionado métodos de notificación. Añade al menos uno (excepto correo) o habilita el correo en la configuración.
ru: Не выбраны способы уведомления. Добавьте хотя бы один (кроме email) или включите email в настройках.

source: Failed to add product, check error messages.
es: Error al añadir producto, revisa los mensajes de error.
ru: Не удалось добавить товар, проверьте сообщения об ошибках.

source: A network error occurred. Please try again.
es: Ocurrió un error de red. Por favor inténtalo de nuevo.
ru: Произошла сетевая ошибка. Пожалуйста, попробуйте снова.
